IDEA StatiCa Open Model
CutOrientation Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents the type of the cut
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum CutOrientation
Public Enumeration CutOrientation
public enum class CutOrientation
Members
Member name | Value | Description
Default | 0 |  The cut is in default (parallel) with cutting plane
Parallel | 1 |  The cut is in parallel with cutting plane
Perpendicular | 2 |  The cut is perpendicular to cutting plane
See Also
Reference
IdeaRS.OpenModel.Connection Namespace